src/cf/Catalogs/МашиночитаемыеДоверенностиКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МашиночитаемыеДоверенностиКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>XMLфайлМЧД</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Верна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиИзРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтзыва</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания в ИБ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доверитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверительИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверительКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВРеестреФНС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесколькоПредставителей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отозвана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолномочияОграничены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПредставитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПредставительИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СовместныеПолномочия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВРеестреФНС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыМашиночитаемойДоверенностиВРеестреФНС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибкиПроверкиМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПодпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННДоверителяРодительскойДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРодительскойДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСкриптПроверкиПолномочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗаполненияПолномочий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыЗаполненияПолномочийМЧД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновленияСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>240</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставительИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ЖурналМашиночитаемыхДоверенностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЖурналМашиночитаемыхДоверенностей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Верна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЕдиныйРегистрационныйНомерДоверенности</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеДоверители</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеПредставители</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.МашиночитаемаяДоверенность</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Хеш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/МашиночитаемыеДоверенностиКонтрагентов/Ext/ObjectModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = МашиночитаемыеДоверенности.ПредставлениеОбъекта(ЭтотОбъект);
	МЧД = Справочники.МашиночитаемыеДоверенностиКонтрагентов.НайтиПоРеквизиту("НомерДоверенности", НомерДоверенности);
	
	Если ЗначениеЗаполнено(МЧД) И Ссылка <> МЧД Тогда
		
		ДополнительныеСвойства.Вставить("МЧД", МЧД);
		ТекстСообщения = НСтр("ru = 'Доверенность с таким номером уже существует'") + ": " + НомерДоверенности;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Отозвана И Не ЗначениеЗаполнено(ДатаОтзыва) Тогда
		ДатаОтзыва = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Не Отозвана И ЗначениеЗаполнено(ДатаОтзыва) Тогда
		ДатаОтзыва = Дата(1, 1, 1);	
	КонецЕсли;
	
	Если Верна И Не Подписана Тогда
		Верна = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ХешФайла) Тогда
		ДанныеФайла = XMLфайлМЧД.Получить();
		Если ТипЗнч(ДанныеФайла) = Тип("ДвоичныеДанные") Тогда
			ХешФайла = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ДанныеФайла, ХешФункция.SHA256);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыЗаписиВЖурналМЧД = МашиночитаемыеДоверенности.НовыеПараметрыЗаписиВЖурналМЧД();
	ДополнительныеСвойства.Вставить("ПараметрыЗаписиВЖурналМЧД", ПараметрыЗаписиВЖурналМЧД);
	Если Не ЭтоНовый() Тогда
		ПредыдущиеЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ХешФайла");
		Если ПредыдущиеЗначенияРеквизитов.ХешФайла <> ХешФайла Тогда
			ПараметрыЗаписиВЖурналМЧД.ИзменилсяХеш = Истина;
			ПараметрыЗаписиВЖурналМЧД.ПредыдущееЗначениеХеша = ПредыдущиеЗначенияРеквизитов.ХешФайла;
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоСозданиеНового", ЭтоНовый());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЭтоСозданиеНового Тогда
		Справочники.ПравилаПроверкиПолномочийМЧД.СоздатьТиповыеПравилаПриЗагрузкеМЧД(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область События

// Добавляет или обновляет запись в журнале МЧД. Возникает в подписке ПриЗаписи.
// См. МашиночитаемыеДоверенности.ЗаписатьМашиночитаемуюДоверенностьВЖурнал
// 
// Параметры:
//  Отказ - Булево
Процедура ЗаписатьВЖурнал(Отказ) Экспорт
	ДанныеДоверенности = XMLфайлМЧД.Получить(); // ДвоичныеДанные
	
	Если Не ЗначениеЗаполнено(ХешФайла) Или Не Подписана Или ДанныеДоверенности = Неопределено
		Или СуществуетДоверенностьОрганизации() Тогда
		Возврат;
	КонецЕсли;
	
	Журнал = РегистрыСведений.ЖурналМашиночитаемыхДоверенностей;
	Запись = Журнал.НоваяЗаписьЖурнала();
	Запись.Хеш = ХешФайла;
	Запись.Номер = НомерДоверенности;
	СведенияФайла = МашиночитаемыеДоверенности.ДанныеИзФайлаОбмена(ДанныеДоверенности).ДанныеДоверенности;
	ТипыДоверителей = Журнал.ТипыДоверителей();
	Если ЗначениеЗаполнено(СведенияФайла.ДоверительФЛ_СНИЛС) Тогда
		СведенияДоверителя = Журнал.НовыйДоверитель(ТипыДоверителей.ИндивидуальныйПредприниматель);
		СведенияДоверителя.ДанныеИндивидуальногоПредпринимателя.Наименование = ОбщегоНазначенияБЭДКлиентСервер.ФИОСтрокой(
			СведенияФайла.ФИО[0]);
		СведенияДоверителя.ДанныеИндивидуальногоПредпринимателя.ИНН = СведенияФайла.ДоверительФЛ_ИНН;
		СведенияДоверителя.ДанныеИндивидуальногоПредпринимателя.СНИЛС = СведенияФайла.ДоверительФЛ_СНИЛС;
	Иначе
		СведенияДоверителя = Журнал.НовыйДоверитель(ТипыДоверителей.ЮридическоеЛицо);
		СведенияДоверителя.ДанныеЮридическогоЛица.Наименование = СведенияФайла.ДоверительЮЛ_НаимОрг;
		СведенияДоверителя.ДанныеЮридическогоЛица.ИНН = СведенияФайла.ДоверительЮЛ_ИНН;
		СведенияДоверителя.ДанныеЮридическогоЛица.КПП = СведенияФайла.ДоверительЮЛ_КПП;
		СведенияДоверителя.ДанныеЮридическогоЛица.ОГРН = СведенияФайла.ДоверительЮЛ_ОГРН;
		ЛицоБезДоверенности = Журнал.НовоеФизическоеЛицо();
		ЛицоБезДоверенности.ФИО = Строка(СведенияФайла.ЛицоБезДовФЛ);
		ЛицоБезДоверенности.СНИЛС = СведенияФайла.ЛицоБезДовФЛ_СНИЛС;
		ЛицоБезДоверенности.ИНН = СведенияФайла.ЛицоБезДовФЛ_ИНН;
		СведенияДоверителя.ДанныеЮридическогоЛица.ЛицаБезДоверенности.Добавить(ЛицоБезДоверенности);
	КонецЕсли;
	Запись.Доверители.Добавить(СведенияДоверителя);
	ТипыПредставителей = Журнал.ТипыПредставителей();
	Для Каждого ПредставительОбъекта Из СведенияФайла.Представители Цикл
		ФИО = ОбщегоНазначенияБЭДКлиентСервер.ФИОСтрокой(ПредставительОбъекта);
		Если ПредставительОбъекта.ТипУполномоченногоПредставителя = "ФЛ" Тогда
			Представитель = Журнал.НовыйПредставитель(ТипыПредставителей.ФизическоеЛицо);
			Представитель.ДанныеФизическогоЛица.ФИО = ФИО;
			Представитель.ДанныеФизическогоЛица.ИНН = ПредставительОбъекта.ПредставительФЛ_ИНН;
			Представитель.ДанныеФизическогоЛица.СНИЛС = ПредставительОбъекта.ПредставительФЛ_СНИЛС;
		ИначеЕсли ПредставительОбъекта.ТипУполномоченногоПредставителя = "ЮЛ" Тогда
			Представитель = Журнал.НовыйПредставитель(ТипыПредставителей.ЮридическоеЛицо);
			Представитель.ДанныеЮридическогоЛица.Наименование = ПредставительОбъекта.ПредставительЮЛ_НаимОрг;
			Представитель.ДанныеЮридическогоЛица.ИНН = ПредставительОбъекта.ПредставительЮЛ_ИНН;
			Представитель.ДанныеЮридическогоЛица.КПП = ПредставительОбъекта.ПредставительЮЛ_КПП;
			Представитель.ДанныеЮридическогоЛица.ОГРН = ПредставительОбъекта.ПредставительЮЛ_ОГРН;
			ПредставительФЛ_СНИЛС = "";
			ПредставительФЛ_ИНН = "";
			Если ПредставительОбъекта.Свойство("ПредставительФЛ_СНИЛС", ПредставительФЛ_СНИЛС)
				Или ПредставительОбъекта.Свойство("ПредставительФЛ_ИНН", ПредставительФЛ_ИНН) Тогда
				ЛицоБезДоверенности = Журнал.НовоеФизическоеЛицо();
				ЛицоБезДоверенности.ФИО = ФИО;
				ЛицоБезДоверенности.СНИЛС = ПредставительФЛ_СНИЛС;
				ЛицоБезДоверенности.ИНН = ПредставительФЛ_ИНН;
				Представитель.ДанныеЮридическогоЛица.ЛицаБезДоверенности.Добавить(ЛицоБезДоверенности);
			КонецЕсли;
		ИначеЕсли ПредставительОбъекта.ТипУполномоченногоПредставителя = "ИП" Тогда
			Представитель = Журнал.НовыйПредставитель(ТипыПредставителей.ИндивидуальныйПредприниматель);
			Представитель.ДанныеИндивидуальногоПредпринимателя.Наименование = ПредставительОбъекта.ПредставительЮЛ_НаимОрг;
			Представитель.ДанныеИндивидуальногоПредпринимателя.ИНН = ПредставительОбъекта.ПредставительЮЛ_ИНН;
			Представитель.ДанныеИндивидуальногоПредпринимателя.СНИЛС = ПредставительОбъекта.ПредставительФЛ_СНИЛС;
			Представитель.ДанныеИндивидуальногоПредпринимателя.ОГРН = ПредставительОбъекта.ПредставительЮЛ_ОГРН;
		Иначе
			Продолжить;
		КонецЕсли;
		Запись.Представители.Добавить(Представитель);
	КонецЦикла;
	Запись.ДатаВыдачи = ДатаВыдачи;
	Запись.Доверенность = Ссылка;
	Запись.ДатаОкончанияДействия = ДатаОкончанияДействия();
	Запись.Верна = Верна;
	Запись.Действует = Действует();
	Запись.ПометкаУдаления = ПометкаУдаления;
	Журнал.ДобавитьЗапись(Запись);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Функция Действует()
	СвойстваДоверенности = МашиночитаемыеДоверенности.НовыеСвойстваДоверенности();
	ЗаполнитьЗначенияСвойств(СвойстваДоверенности, ЭтотОбъект);
	Возврат МашиночитаемыеДоверенности.ДоверенностьДействительнаПоСвойствам(СвойстваДоверенности, ТекущаяДатаСеанса());
КонецФункции

Функция ДатаОкончанияДействия()
	Если ЗначениеЗаполнено(ДатаОкончания) И Не ЗначениеЗаполнено(ДатаОтзыва) Тогда
		Возврат ДатаОкончания;
	ИначеЕсли ЗначениеЗаполнено(ДатаОтзыва) И Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		Возврат ДатаОтзыва;
	Иначе
		Возврат Мин(ДатаОкончания, ДатаОтзыва);
	КонецЕсли;
КонецФункции

Функция СуществуетДоверенностьОрганизации()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				   |	Ссылка
				   |ИЗ
				   |	Справочник.МашиночитаемыеДоверенностиОрганизаций
				   |ГДЕ
				   |	ХешФайла = &ХешФайла";
	Запрос.УстановитьПараметр("ХешФайла", ХешФайла);
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
